#include "QDTFT_demo.h"
/*---------------------------液晶屏接线说明-------------------------------------
//sbit bl        =P3^2;//接模块LED引脚，背光可以采用IO控制或者PWM控制，也可以直接接到高电平常亮
//sbit scl       =P1^7;//接模块CLK引脚,
//sbit sda       =P1^5;//接模块SDI引脚，
//sbit rs        =P0^2;//接模块RS引脚，
//sbit cs        =P0^3;//接模块CS引脚
//sbit reset     =P3^3;//接模块RST引脚
//VCC:可以接5V也可以接3.3V
//LED:可以接5V也可以接3.3V或者使用任意空闲IO控制(高电平使能)
//GND：接电源地
//说明：如需要尽可能少占用IO，可以将LCD_CS接地，LCD_LED接3.3V，LCD_RST接至单片机复位端，
//将可以释放3个可用IO
//接口定义在Lcd_Driver.h内定义，
//如需变更IO接法，请根据您的实际接线修改相应IO初始化LCD_GPIO_Init()
//-----------------------------------------------------------------------------------------
例程功能说明：
1.	简单刷屏测试
2.	英文显示测试示例
3.	中文显示测试示例
4.	数码管字体显示示例
5.	图片显示示例
6.	2D按键菜单示例
7.	本例程支持横屏/竖屏切换(开启宏USE_HORIZONTAL,详见Lcd_Driver.h)
8.	本例程支持软件模拟SPI/硬件SPI切换(开启宏USE_HARDWARE_SPI,详见Lcd_Driver.h)
**********************************************************************************************/

main()
{
#ifdef MCU_STC12
	P3M1 &= ~(1<<2),	P3M0 |=  (1<<2);	//P3.2设置成推挽输出
#endif

  while(1)
  {	
  	QDTFT_Test_Demo(); 
  }
 }
